tap "aerobounce/tap"
tap "arl/arl"
tap "buo/cask-upgrade"
tap "d12frosted/emacs-plus"
tap "eth-p/software"
tap "felixkratz/formulae"
tap "fsouza/prettierd"
tap "gromgit/brewtils"
tap "jesseduffield/lazydocker"
tap "jstkdng/programs"
tap "nikitabobko/tap"
tap "oven-sh/bun"
tap "romkatv/powerlevel10k"
tap "sst/tap"
tap "th-ch/youtube-music"
# Aquarium animation in ASCII art
brew "asciiquarium"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Arbitrary precision numeric processing language
brew "bc"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Core application library for C
brew "glib"
# Console Bonsai is a bonsai tree generator, written in C using ncurses
brew "cbonsai"
# Object-file caching compiler wrapper
brew "ccache"
# OpenType text shaping engine
brew "harfbuzz"
# Versatile and fast Unicode/ASCII/ANSI graphics renderer
brew "chafa"
# Cross-platform make
brew "cmake"
# Documentation for CMake
brew "cmake-docs"
# Dependency manager for Cocoa projects
brew "cocoapods"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Embeddable SQL OLAP Database Management System
brew "duckdb"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Create thumbnails for your video files
brew "ffmpegthumbnailer"
# GNU compiler collection
brew "gcc"
# Fast and simple Node.js version manager
brew "fnm"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Git extension for versioning large files
brew "git-lfs"
# Render markdown on the CLI
brew "glow"
# GNU version of the tar archiving utility
brew "gnu-tar"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# RSS/Atom feeds in the terminal
brew "goread"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GNU grep, egrep and fgrep
brew "grep"
# Tool for glamorous shell scripts
brew "gum"
# Popular GNU data compression program
brew "gzip"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# JSON parser and validator with a CLI
brew "jsonlint"
# Simple terminal UI for git commands
brew "lazygit"
# Pager program similar to more
brew "less"
# JIT library for the GNU compiler collection
brew "libgccjit"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit"
# Package manager for the Lua programming language
brew "luarocks"
# Utility for directing compilation
brew "make"
# Mac App Store command-line interface
brew "mas"
# Like sed, awk, cut, join & sort for name-indexed data such as CSV
brew "miller"
# Jupyter Notebook Diff and Merge tools
brew "nbdime"
# Small build system for use with gyp or CMake
brew "ninja"
# Optimized BLAS library
brew "openblas"
# Shell command parallelization utility
brew "parallel"
# Command-line tool to generate, analyze, convert and manipulate colors
brew "pastel"
# Package management made easy
brew "pixi"
# Tool for managing OCI containers and pods
brew "podman"
# Alternative to docker-compose using podman
brew "podman-compose"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Command-line toolbox for fancy output in the terminal
brew "rich-cli"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Rust toolchain installer
brew "rustup"
# Smart session manager for the terminal
brew "sesh"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# Command-line tool to customize Spotify client
brew "spicetify-cli"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Opinionated Lua code formatter
brew "stylua"
# User interface to the TELNET protocol
brew "telnet"
# Official tldr client written in Rust
brew "tlrc"
# Terminal multiplexer
brew "tmux"
# Program that allows you to count code, quickly
brew "tokei"
# Plugin manager for tmux
brew "tpm"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Markup-based typesetting system
brew "typst"
# Extraction utility for .zip compressed archives
brew "unzip"
# Vi 'workalike' with many additional features
brew "vim"
# Generator for LS_COLORS with support for multiple color themes
brew "vivid"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Access X11 clipboards from the command-line
brew "xclip"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Programming language designed for robustness, optimality, and clarity
brew "zig"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Better and friendly vi(vim) mode plugin for ZSH
brew "zsh-vi-mode"
# User Defaults Plist → Shell Script converter with Regex filtering
brew "aerobounce/tap/ds"
# Git in your tmux status bar.
brew "arl/arl/gitmux"
# Quickly search through and highlight files using ripgrep
brew "eth-p/software/bat-extras-batgrep"
# A window border system for macOS
brew "felixkratz/formulae/borders"
# Custom macOS statusbar with shell plugin, interaction and graph support
brew "felixkratz/formulae/sketchybar"
# prettier, on SPEED!
brew "fsouza/prettierd/prettierd"
# Interactive TUI for Homebrew
brew "gromgit/brewtils/taproom"
# A simple terminal UI for docker, written in Go
brew "jesseduffield/lazydocker/lazydocker"
# Drop in replacement for ueberzug written in C++
brew "jstkdng/programs/ueberzugpp"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# The AI coding agent built for the terminal.
brew "sst/tap/opencode"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# AeroSpace is an i3-like tiling window manager for macOS
cask "aerospace"
# Menu bar tool to limit maximum charging percentage
cask "aldente"
# Tools for building Android applications
cask "android-studio"
# Display management tool
cask "betterdisplay"
# E-books management software
cask "calibre"
# Automated testing of webapps for Google Chrome
cask "chromedriver"
# Voice and text chat software
cask "discord"
cask "font-caskaydia-cove-nerd-font"
cask "font-maple-mono-nf"
cask "font-noto-color-emoji"
cask "font-sf-pro"
cask "font-symbols-only-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty@tip"
# Desktop client for GitHub repositories
cask "github"
# Web browser
cask "google-chrome"
# Free and open-source media player
cask "iina"
# Tool to optimise images to a smaller size
cask "imageoptim"
# Menu bar calendar
cask "itsycal"
# Menu bar manager
cask "jordanbaird-ice@beta"
# Keyboard customiser
cask "karabiner-elements"
# File archiver
cask "keka"
# Helper application for the Keka file archiver
cask "kekaexternalhelper"
# Discover, download, and run local LLMs
cask "lm-studio"
# Add middle click for Trackpad and Magic Mouse
cask "middle"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Finds large, unwanted files and deletes them
cask "omnidisksweeper"
# Remote desktop
cask "parsec"
# Control your tools with a few keystrokes
cask "raycast"
# Email client
cask "readdle-spark"
# Music streaming service
cask "spotify"
# System monitor for the menu bar
cask "stats"
# Video game digital distribution service
cask "steam"
# Open-source media center
cask "stremio"
# Text editor for code, markup and prose
cask "sublime-text"
# Dictation tool including LLM reformatting
cask "superwhisper"
# Utility to hide the notch
cask "topnotch"
# Open-source BitTorrent client
cask "transmission"
# Easy to use text extraction tool
cask "trex"
# Virtual machines UI using QEMU
cask "utm"
# Multimedia player
cask "vlc"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm@nightly"
# VPN client for secure internet access and private browsing
cask "windscribe"
# REST, GraphQL and gRPC client
cask "yaak"
# YouTube Music Desktop App
cask "youtube-music"
# Gecko based web browser
cask "zen"
# Video communication and virtual meeting platform
cask "zoom"
# OpenJDK distribution from Azul
cask "zulu@17"
mas "1Password for Safari", id: 1569813296
mas "Amphetamine", id: 937984704
mas "Disk Space Analyzer", id: 446243721
mas "Dropover", id: 1355679052
mas "Glance", id: 1564688210
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Steam Link", id: 1246969117
mas "WhatsApp", id: 310633997
mas "Xcode", id: 497799835
