tap "buo/cask-upgrade"
tap "d12frosted/emacs-plus"
tap "felixkratz/formulae"
tap "fsouza/prettierd"
tap "jesseduffield/lazydocker"
tap "jimeh/emacs-builds"
tap "nikitabobko/tap"
tap "romkatv/powerlevel10k"
brew "asciiquarium"
brew "basedpyright"
brew "bat"
brew "bc"
brew "btop"
brew "gettext"
brew "glib"
brew "cbonsai"
brew "ccache"
brew "cmake"
brew "cmake-docs"
brew "conda-zsh-completion"
brew "coreutils"
brew "curl"
brew "deno"
brew "eza"
brew "fastfetch"
brew "fd"
brew "harfbuzz"
brew "ffmpeg"
brew "ffmpegthumbnailer"
brew "fnm"
brew "fortune"
brew "fzf"
brew "gcc"
brew "gh"
brew "git"
brew "git-delta"
brew "glow"
brew "gnu-tar"
brew "go"
brew "goread"
brew "grep"
brew "gzip"
brew "imagemagick"
brew "jsonlint"
brew "lazygit"
brew "libgccjit"
brew "luajit"
brew "luarocks"
brew "make"
brew "mas"
brew "miller"
brew "nbdime"
brew "ninja"
brew "openblas"
brew "parallel"
brew "pixi"
brew "pkgconf"
brew "podman"
brew "podman-compose"
brew "poppler"
brew "rich-cli"
brew "ripgrep"
brew "sl"
brew "spicetify-cli"
brew "sqlfluff"
brew "starship"
brew "stow"
brew "stylua"
brew "telnet"
brew "tlrc"
brew "tokei"
brew "tree"
brew "typst"
brew "unzip"
brew "vivid"
brew "watchman"
brew "wget"
brew "xclip"
brew "yazi"
brew "yt-dlp"
brew "zellij"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-vi-mode"
brew "d12frosted/emacs-plus/emacs-plus@30"
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"
brew "fsouza/prettierd/prettierd"
brew "jesseduffield/lazydocker/lazydocker"
cask "1password"
cask "aerospace"
cask "aldente"
cask "anaconda"
cask "android-studio"
cask "bartender"
cask "betterdiscord-installer"
cask "betterdisplay"
cask "calibre"
cask "chromedriver"
cask "discord"
cask "disk-inventory-x"
cask "font-caskaydia-cove-nerd-font"
cask "font-hack-nerd-font"
cask "font-maple-mono-nf"
cask "font-noto-color-emoji"
cask "font-sf-pro"
cask "font-symbols-only-nerd-font"
cask "ghostty"
cask "github"
cask "google-chrome"
cask "iina"
cask "imageoptim"
cask "itsycal"
cask "karabiner-elements"
cask "keka"
cask "kekaexternalhelper"
cask "mailspring"
cask "middle"
cask "obsidian"
cask "parsec"
cask "raycast"
cask "spotify"
cask "stats"
cask "steam"
cask "stremio"
cask "transmission"
cask "trex"
cask "visual-studio-code"
cask "vlc"
cask "vscodium"
cask "wezterm@nightly"
cask "windscribe"
cask "yaak"
cask "zen"
cask "zoom"
cask "zulu@17"
mas "1Password for Safari", id: 1569813296
mas "Amphetamine", id: 937984704
mas "Dropover", id: 1355679052
mas "Glance", id: 1564688210
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Steam Link", id: 1246969117
mas "WhatsApp", id: 310633997
mas "Xcode", id: 497799835
