[
  "obsidian-style-settings",
  "obsidian-linter",
  "obsidian-vimrc-support",
  "obsidian-relative-line-numbers",
  "obsidian-hider",
  "vim-yank-highlight",
  "obsidian-toggle-list",
  "obsidian-auto-link-title",
  "templater-obsidian",
  "homepage",
  "dataview",
  "obsidian-charts",
  "obsidian-excalidraw-plugin",
  "mononote",
  "settings-search",
  "callout-suggestions",
  "callout-manager",
  "tag-wrangler",
  "colored-tags",
  "obsidian-book-search-plugin",
  "obsidian-reading-time",
  "better-word-count",
  "obsidian-plugin-update-tracker",
  "pexels-banner",
  "obsidian-completr",
  "obsidian-focus-mode"
]