tap "aerobounce/tap"
tap "arl/arl"
tap "buo/cask-upgrade"
tap "charmbracelet/tap"
tap "code-yeongyu/tap"
tap "databricks/tap"
tap "eth-p/software"
tap "felixkratz/formulae"
tap "fsouza/prettierd"
tap "jesseduffield/lazydocker"
tap "nikitabobko/tap"
tap "oven-sh/bun"
tap "romkatv/powerlevel10k"
tap "sst/tap"
tap "th-ch/youtube-music"
tap "tylergraydev/cctm"
# Aquarium animation in ASCII art
brew "asciiquarium"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Library for command-line editing
brew "readline"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Arbitrary precision numeric processing language
brew "bc"
# General-purpose data compression with high compression ratio
brew "xz"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Core application library for C
brew "glib"
# Object-file caching compiler wrapper
brew "ccache"
# OpenType text shaping engine
brew "harfbuzz"
# Versatile and fast Unicode/ASCII/ANSI graphics renderer
brew "chafa"
# Cut, copy, and paste anything, anywhere, all from the terminal
brew "clipboard"
# Cross-platform make
brew "cmake"
# Documentation for CMake
brew "cmake-docs"
# Dependency manager for Cocoa projects
brew "cocoapods"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Command-line interface for SQLite
brew "sqlite"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Create thumbnails for your video files
brew "ffmpegthumbnailer"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Fast and simple Node.js version manager
brew "fnm"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# GNU compiler collection
brew "gcc"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Git extension for versioning large files
brew "git-lfs"
# Render markdown on the CLI
brew "glow"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# RSS/Atom feeds in the terminal
brew "goread"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GNU grep, egrep and fgrep
brew "grep"
# Tool for glamorous shell scripts
brew "gum"
# Popular GNU data compression program
brew "gzip"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# JSON parser and validator with a CLI
brew "jsonlint"
# TUI tool for monitoring and exploration of Kubernetes resources
brew "kubetui"
# Simple terminal UI for git commands
brew "lazygit"
# JIT library for the GNU compiler collection
brew "libgccjit"
# SIXEL encoder/decoder implementation
brew "libsixel"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit"
# Package manager for the Lua programming language
brew "luarocks"
# Utility for directing compilation
brew "make"
# Sync your markdown files with Confluence pages
brew "mark"
# Mac App Store command-line interface
brew "mas"
# Like sed, awk, cut, join & sort for name-indexed data such as CSV
brew "miller"
# Jupyter Notebook Diff and Merge tools
brew "nbdime"
# Small build system for use with gyp or CMake
brew "ninja"
# Optimized BLAS library
brew "openblas"
# Shell command parallelization utility
brew "parallel"
# Package management made easy
brew "pixi"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Tool for managing OCI containers and pods
brew "podman"
# Alternative to docker-compose using podman
brew "podman-compose"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Python version management
brew "pyenv"
# Command-line toolbox for fancy output in the terminal
brew "rich-cli"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Rust toolchain installer
brew "rustup"
# Smart session manager for the terminal
brew "sesh"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# Command-line tool to customize Spotify client
brew "spicetify-cli"
# SQL linter and auto-formatter for Humans
brew "sqlfluff"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Opinionated Lua code formatter
brew "stylua"
# Very fast implementation of tldr in Rust
brew "tealdeer"
# Modernized, complete, self-contained TeX/LaTeX engine
brew "tectonic"
# User interface to the TELNET protocol
brew "telnet"
# AI Chatbots in terminal without needing API keys
brew "tgpt"
# Terminal multiplexer
brew "tmux"
# Program that allows you to count code, quickly
brew "tokei"
# Plugin manager for tmux
brew "tpm"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Parser generator tool
brew "tree-sitter-cli"
# Customize your Claude Code themes, thinking verbs, and more
brew "tweakcc"
# Markup-based typesetting system
brew "typst"
# Extraction utility for .zip compressed archives
brew "unzip"
# Pretty print math in monospace fonts, using a TeX-like syntax
brew "utftex"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Vi 'workalike' with many additional features
brew "vim"
# Generator for LS_COLORS with support for multiple color themes
brew "vivid"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Access X11 clipboards from the command-line
brew "xclip"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Programming language designed for robustness, optimality, and clarity
brew "zig"
# General-purpose lossless data-compression library
brew "zlib"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Better and friendly vi(vim) mode plugin for ZSH
brew "zsh-vi-mode"
# User Defaults Plist → Shell Script converter with Regex filtering
brew "aerobounce/tap/ds"
# Git in your tmux status bar.
brew "arl/arl/gitmux"
# Multi-language comment detection hook for Claude Code and OpenCode
brew "code-yeongyu/tap/comment-checker"
# Command-line interface for the Databricks platform
brew "databricks/tap/databricks"
# Quickly search through and highlight files using ripgrep
brew "eth-p/software/bat-extras-batgrep"
# A window border system for macOS
brew "felixkratz/formulae/borders"
# prettier, on SPEED!
brew "fsouza/prettierd/prettierd"
# A simple terminal UI for docker, written in Go
brew "jesseduffield/lazydocker/lazydocker"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# The AI coding agent built for the terminal.
brew "sst/tap/opencode"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Display management tool
cask "betterdisplay"
# Automated testing of webapps for Google Chrome
cask "chromedriver"
# Terminal-based AI coding assistant
cask "claude-code"
# Manage tools and MCP servers for Claude Code CLI
cask "tylergraydev/cctm/claude-code-tool-manager"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# Databases and SQL IDE
cask "datagrip"
# Universal database tool and SQL client
cask "dbeaver-community"
cask "font-caskaydia-cove-nerd-font"
cask "font-maple-mono-nf"
cask "font-mononoki-nerd-font"
cask "font-noto-color-emoji"
cask "font-sf-pro"
cask "font-symbols-only-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty@tip"
# Desktop client for GitHub repositories
cask "github"
# Web browser
cask "google-chrome@canary"
# Menu bar calendar
cask "itsycal"
# Menu bar manager
cask "jordanbaird-ice@beta"
# Keyboard customiser
cask "karabiner-elements"
# File archiver
cask "keka"
# Helper application for the Keka file archiver
cask "kekaexternalhelper"
# GPU-based terminal emulator
cask "kitty@nightly"
# Application launcher
cask "leader-key"
# Customise mouse behavior
cask "linearmouse"
# Discover, download, and run local LLMs
cask "lm-studio"
# Add middle click for Trackpad and Magic Mouse
cask "middle"
# AI coding agent desktop client
cask "opencode-desktop"
# IDE for professional Python development
cask "pycharm"
# Kubernetes and container management on the desktop
cask "rancher"
# Control your tools with a few keystrokes
cask "raycast"
# Email client
cask "readdle-spark"
# Music streaming service
cask "spotify"
# System monitor for the menu bar
cask "stats"
# Dictation tool including LLM reformatting
cask "superwhisper"
# Utility to hide the notch
cask "topnotch"
# Open-source code editor
cask "visual-studio-code"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm@nightly"
# REST, GraphQL and gRPC client
cask "yaak"
# YouTube Music Desktop App
cask "th-ch/youtube-music/youtube-music"
# Multiplayer code editor
cask "zed@preview"
# OpenJDK distribution from Azul
cask "zulu@17"
mas "Dropover", id: 1355679052
mas "Glance", id: 1564688210
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "uBlock Origin Lite", id: 6745342698
